import pytest

from src.masks import get_mask_card_number


@pytest.mark.parametrize(
    "card_number, expected",
    [
        ("5555444433332222", "5555 44** **** 2222"),
        ("1234987645673843", "1234 98** **** 3843"),
        ("4111 1111 1111 1111", "4111 11** **** 1111"),
        ("3782 8224 6310 005", "Номер карты должен содержать 16 цифр."),
        ("6011 1111 1111 1117", "6011 11** **** 1117"),
        ("3568 9532 1786 2905", "3568 95** **** 2905"),
        ("5018 1234 5678 9010", "5018 12** **** 9010"),
        ("6200 1234 5678 9010", "6200 12** **** 9010"),
        ("4026 4865 2000 1234", "4026 48** **** 1234"),
        ("5085 1234 5678 9123", "5085 12** **** 9123"),
        ("6011 1111 1111 1117", "6011 11** **** 1117"),
        ("3568 9532 16 2905", "Номер карты должен содержать 16 цифр."),
        ("5018 1234 578 9010", "Номер карты должен содержать 16 цифр."),
        ("6200 12sda 5678 9010", "Номер карты должен содержать 16 цифр."),
        ("4026 48ds2000 1234", "Номер карты должен содержать 16 цифр."),
        ("5085 12vg 43 5678 9123", "Номер карты должен содержать 16 цифр."),
        ("", "Номер карты должен содержать 16 цифр."),
    ],
)
def test_get_mask_card_number_param_1(card_number, expected):
    assert get_mask_card_number(card_number) == expected
